function backToThePast(input) {
  let heritage = Number(input[0]);
  let age = Number(input[1]);
  let moneySpend = 0;
  let ivanchoAge = 18;

  for (let i = 1800; i <= age; i++) {
    if (i % 2 === 0) {
      moneySpend += 12000;
    } else {
      moneySpend = moneySpend + 12000 + ivanchoAge * 50;
    }
    ivanchoAge++;
  }

  if (moneySpend <= heritage) {
    let moneyLeft = heritage - moneySpend;

    console.log(
      `Yes! He will live a carefree life and will have ${moneyLeft.toFixed(
        2
      )} dollars left.`
    );
  } else {
    let moneyNeeded = moneySpend - heritage;

    console.log(`He will need ${moneyNeeded.toFixed(2)} dollars to survive.`);
  }
}

backToThePast(["50000", "1802"]);

/*
Прочети хубаво пак цялото условие на задачата.
Първата иф-конструкция трябва да я промениш (10 и 12 ред). Виж условието. 2.1.  Декларирай си age променлива и после я използвай.
На 17-ти ред ти липсва нещо.
На 7-ми ред защо i = 2? Ако i = 2; yearmustlive 1803, фор цикъла ще върти 1801 пъти, ще получиш космическо число. Помисли за логиката.
24 и 25 ред са част от for конструкцията.

    */

/*
Иванчо е на 18 години и получава наследство, което се състои от X сума пари и машина на времето. Той решава да се върне до 1800 година, но не знае дали парите ще са достатъчни, за да живее без да работи. Напишете програма, която пресмята, дали Иванчо ще има достатъчно пари, за да не се налага да работи до дадена година включително. Като приемем, че за всяка четна (1800, 1802 и т.н.) година ще харчи 12 000 лева. За всяка нечетна (1801,1803  и т.н.) ще харчи 12 000 + 50 * [годините, които е навършил през дадената година].
Вход
Входът се чете от конзолата и съдържа точно 2 реда:
•	Наследените пари – реално число в интервала [1.00 ... 1 000 000.00]
•	Годината, до която трябва да живее (включително) – цяло число в интервала [1801 ... 1900]
Изход
Да се отпечата на конзолата 1 ред. Сумата трябва да е форматирана до два знака след десетичната запетая:
•	Ако парите са достатъчно:
o	"Yes! He will live a carefree life and will have {N} dollars left." – където N са парите, които ще му останат.
•	Ако парите НЕ са достатъчно:
o	"He will need {М} dollars to survive." – където M е сумата, която НЕ достига.
Примерен вход и изход
Вход	Изход	Обяснения
50000
1802	Yes! He will live a carefree life and will have 13050.00 dollars left.	1800 → четна 
         → Харчи 12000 лева 
         → Остават 50000 – 12000 = 38000
1801 → нечетна 
         → Харчи 12000 + 19*50 = 12000 + 950 = 12950
         → Остават 38000 – 12950 = 25050
1802 → четна 
         → Харчи 12000 лева
         → Остават 25050 – 12000 = 13050
Вход	Изход	Обяснения
100000.15
1808	He will need 12399.85 dollars to survive.	1800 → четна 
         → Остават 100000.15 – 12000 = 88000.15
1801 → нечетна 
         → Остават 100000.15 – 12950 = 87050.15
...
1808 → четна → -399.85 – 12000 = -12399.85
12399.85 не достигат

*/
